[
  {
    "name": "Akbar",
    "date": "11 months ago",
    "level": "A-Level",
    "rating": 5,
    "testimonial": "Giuliano helped me achieve a grade A in A-Level Maths and I honestly could not have done it without his incredible support 😄. His clear explanations, challenging practice, and constant availability made a huge difference. I always felt confident going into exams thanks to his guidance."
  },
  {
    "name": "Aurelie Parnes",
    "date": "1 year ago",
    "level": "Primary",
    "rating": 5,
    "testimonial": "Giuliano has been tutoring our children for years and he's a real gem. He explains concepts clearly, adds humour to keep things light, and his passion for maths has helped our kids appreciate the subject."
  },
  {
    "name": "Avi Allon",
    "date": "1 year ago",
    "level": "GCSE & A-Level",
    "rating": 5,
    "testimonial": "Giuliano helped me achieve a Grade 9 in GCSE Maths and is now supporting me with Maths and Further Maths A-Levels. He’s boosted my skills enormously and is also a kind and considerate mentor."
  },
  {
    "name": "Jo Kercher",
    "date": "10 months ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Giules is a professional, reliable, and highly capable tutor. My son felt in good hands from the start and knew he could contact Giules anytime if he got stuck. Highly recommended."
  },
  {
    "name": "Michelle Lustig",
    "date": "11 months ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "GG Maths gave our daughter the confidence she needed and helped her achieve her target grade. Giuliano has a warm and encouraging approach."
  },
  {
    "name": "Orli Allon",
    "date": "3 years ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "I used to struggle with maths, getting around level 4s. After working weekly with Giuliano, I achieved a Level 7 (A) in my GCSE 😄. He’s a brilliant tutor who genuinely cares about his students."
  },
  {
    "name": "Karen Gubbay",
    "date": "3 years ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "In 18 months of lessons, my son went from struggling to achieving a Grade 8 in GCSE Maths. Giuliano is approachable, thorough, and made my son feel comfortable asking anything."
  },
  {
    "name": "Rhona",
    "date": "3 years ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Giuliano’s friendly, approachable style was exactly what our son needed. He achieved a Grade 7 in GCSE Maths, far higher than expected."
  },
  {
    "name": "Adam Lewry",
    "date": "1 year ago",
    "level": "A-Level",
    "rating": 5,
    "testimonial": "Giuliano’s thorough teaching let me treat school classes as revision, helping me comfortably achieve an A* in A-Level Maths."
  },
  {
    "name": "Cristiano Murphy",
    "date": "2 years ago",
    "level": "A-Level",
    "rating": 5,
    "testimonial": "Giuliano was engaging and thorough, helping me secure a Grade A in A-Level Maths and a place at my first-choice university 🙏."
  },
  {
    "name": "Ann Davies",
    "date": "5 years ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Giuliano’s expert knowledge of exam papers and friendly approach gave my son the confidence to aim high. He was on track for a Level 7 in GCSE Maths."
  },
  {
    "name": "Tania",
    "date": "1 year ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Giuliano helped my son achieve his target grade in GCSE Maths. I’d highly recommend him as a tutor."
  },
  {
    "name": "Chris Harrington",
    "date": "1 year ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "We switched tutors and I’m so glad we did. Giuliano helped my son pass GCSE Maths and enjoy lessons again."
  },
  {
    "name": "Aoife Thompson",
    "date": "1 year ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Giuliano explained concepts clearly and supported me through my GCSEs. I’d definitely recommend him."
  },
  {
    "name": "Alex Georgiou",
    "date": "5 years ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "With Giuliano’s help, my daughter passed her GCSE Maths with flying colours. He’s now tutoring my nephew, whose grades are climbing fast."
  },
  {
    "name": "Stefano Massaro",
    "date": "1 year ago",
    "level": "Primary",
    "rating": 5,
    "testimonial": "Organised tutoring for my cousin with Giuliano and he’s been brilliant — easy to arrange, engaging lessons, and reasonable prices."
  },
  {
    "name": "Ray Casey",
    "date": "1 year ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Our son hated school and wasn’t revising, but Giuliano helped him achieve a Grade 5 in Maths 💪🏻✅ and improved his attitude to learning."
  },
  {
    "name": "Ben Halloran",
    "date": "11 months ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Went from Grade 3 to Grade 7 in under a year! Giuliano really improved my understanding of maths 😁."
  },
  {
    "name": "Stephanie Radhakishun",
    "date": "3 years ago",
    "level": "A-Level",
    "rating": 5,
    "testimonial": "I got an A in A-Level Maths thanks to Giuliano! He massively improved my skills and exam technique."
  },
  {
    "name": "Rohan J",
    "date": "3 years ago",
    "level": "GCSE",
    "rating": 5,
    "testimonial": "Giuliano’s teaching methods helped me achieve a Grade 9 in GCSE Maths. Highly recommended."
  }
]
