[
  {
    "id": "kiran-gcse-alevel",
    "student_name": "Kiran",
    "title": "Kiran — GCSE & A-Level Achievement",
    "tags": ["GCSE", "A-Level"],
    "video": {
      "url": "https://www.youtube.com/embed/YB_D8rCUBCE",
      "title": "Kiran’s Maths Journey"
    },
    "pullquote": "I was aiming for a 6 or 7. Getting a 9 was a huge surprise and a great achievement.",
    "summary": "Kiran joined GG Maths in Year 10, predicted a Grade 6 in GCSE Maths. With tailored lessons and step-by-step guidance, he turned weaknesses into strengths, achieving a top 2% Grade 9 at GCSE. Carrying this mindset into A-Level, we fast-tracked Year 12 content, giving him extra time for Year 13’s toughest topics. The result: an A in A-Level Maths and a place at University of Birmingham to study Mathematics and Music.",
    "outcomes": {
      "gcse_predicted": "6",
      "gcse_achieved": "9",
      "alevel_achieved": "A"
    },
    "entry_stage": "Year 10"
  },
  {
    "id": "adrian-year7-to-year9",
    "student_name": "Adrian",
    "title": "Adrian — From Struggling in Year 7 to Confident in Year 9",
    "tags": ["KS3", "Year 8"],
    "video": {
      "url": "https://www.youtube.com/embed/yeNtGwH-bmk",
      "title": "Adrian’s Maths Journey"
    },
    "pullquote": "In less than six months, he started picking it up and he started performing at above 80%.",
    "summary": "When Adrian joined GG Maths in Year 7, his maths results were below 50%. With one-to-one tutoring, clear step-by-step lessons, and targeted homework, he rebuilt his skills and confidence. In just six months, his marks rose to 85%. Now, learning topics ahead of class gives him a clear edge — proof that the right support can turn setbacks into success.",
    "outcomes": {
      "initial_score": "Below 50%",
      "improved_score_noncalc": "49/60",
      "improved_score_calc": "53/60"
    },
    "entry_stage": "Year 7"
},
  {
    "id": "emily-alevel",
    "student_name": "Emily",
    "title": "Emily — From B to A* at A-Level",
    "tags": ["A-Level"],
    "video": {
      "url": "https://www.youtube.com/embed/dQw4w9WgXcQ",
      "title": "Emily’s A-Level Maths Journey"
    },
    "pullquote": "The step from GCSE to A-Level was huge, but I felt supported every step of the way.",
    "summary": "Emily was aiming for a B in A-Level Maths but wanted an A* to secure a place at her dream university. We focused on advanced problem-solving, calculus, and proof techniques, building depth of understanding. She achieved her A* and gained a place at Cambridge.",
    "outcomes": {
      "alevel_predicted": "B",
      "alevel_achieved": "A*"
    },
    "entry_stage": "Year 12"
  },
  {
    "id": "matthew-gcse",
    "student_name": "Matthew",
    "title": "Matthew — Confidence and Results",
    "tags": ["GCSE"],
    "video": {
      "url": "https://www.youtube.com/embed/dQw4w9WgXcQ",
      "title": "Matthew’s Maths Confidence Story"
    },
    "pullquote": "I used to think I wasn’t a ‘maths person’ — now I know I can do it.",
    "summary": "Matthew entered Year 10 struggling with maths and self-belief, predicted a Grade 4. By starting with strong foundations and building up to more complex topics, his confidence soared. He achieved a Grade 8 in GCSE Maths and now feels ready for any challenge.",
    "outcomes": {
      "gcse_predicted": "4",
      "gcse_achieved": "8"
    },
    "entry_stage": "Year 10"
  }
]
